const lessonsAndTime = [
                 [['Завтрак', '', 'Ист.России', 'Лит-ра', '2-й завтрак', 'Лит-ра', 'Анализ', 'Анализ', 'Обед', 'Анализ', '', 'Полдник', 'Ужин'],     
                    ['8.10-8.40', '', '9.40-10.25', '10.35-11.20', '11.20-11.35', '11.40-12.25', '12.35-13.20', '13.30-14.15', '14.15-15.05', '15.05-15.50', '', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', 'Физика', 'Физика', 'Англ.яз.', '2-й завтрак', 'Информатика', 'Информатика', 'Информатика', 'Обед', 'ОБЖ', '', 'Полдник', 'Ужин'],                                  
                    ['8.10-8.40', '8.45-9.30', '9.40-10.25', '10.35-11.20', '11.20-11.35', '11.40-12.25', '12.35-13.20', '13.30-14.15', '14.15-15.05', '15.05-15.50', '', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', 'Алгебра', 'Алгебра', 'Алгебра', '2-й завтрак', 'Мат.прак', 'Физ-ра', 'Физ-ра', 'Обед', '', '', 'Полдник', 'Ужин'],                 
                    ['8.10-8.40', '8.45-9.30', '9.40-10.25', '10.35-11.20', '11.20-11.35', '11.40-12.25', '12.35-13.20', '13.30-14.15', '14.15-15.05', '', '', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', 'Физика', 'Физика', 'Физика', '2-й завтрак', 'Физика', 'Англ.яз.', 'Англ.яз.', 'Обед', 'Физ.прак', 'Физ.прак', 'Полдник', 'Ужин'],                
                    ['8.10-8.40', '8.45-9.30', '9.40-10.25', '10.35-11.20', '11.20-11.35', '11.40-12.25', '12.35-13.20', '13.30-14.15', '14.15-15.05', '15.05-15.50', '16.00-16.45', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', 'Геометрия', 'Геометрия', 'Геометрия', '2-й завтрак', 'Биология', 'Лит-ра', 'Химия', 'Обед', 'Русск.яз.', '', 'Полдник', 'Ужин'],            
                    ['8.10-8.40', '8.45-9.30', '9.40-10.25', '10.35-11.20', '11.20-11.35', '11.40-12.25', '12.35-13.20', '13.30-14.15', '14.15-15.05', '15.05-15.50', '', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', 'Общество', 'Общество', '', '2-й завтрак', 'Вс.история', '', '', 'Обед', '', '', 'Полдник', 'Ужин'],
                    ['8.10-8.40', '8.45-9.30', '9.40-10.25', '', '11.20-11.35', '11.40-12.25', '', '', '14.15-15.05', '', '', '16.40-16.55', '19.15-19.45']],
                 [['Завтрак', '', '', '', '2-й завтрак', '', '', '', 'Обед', '', '', 'Полдник', 'Ужин'],
                    ['8.10-8.40', '', '', '', '11.20-11.35', '', '', '', '14.15-15.05', '', '', '16.40-16.55', '19.15-19.45']]];

const days = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
const numLesson = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten', 'eleven', 'twelve', 'thirteen'];
const timeLesson = ['onetime', 'twotime', 'threetime', 'fourtime', 'fivetime', 'sixtime', 'seventime', 'eighttime', 'ninetime', 'tentime', 'eleventime', 'twelvetime', 'thirteentime'];

var now = new Date();
str = now.toLocaleString().split(' ');
time = str[1].split(':')[0];
ampm = str[2];
var _day_ = now.getDay() - 1;
var day_ = document.getElementById('Day');
day_.innerHTML = days[_day_];
day_.style.cssText = "margin: 30px; font-size: 70px; text-align: center;";

for (let i = 0; i < 13; i++){
    var les = document.getElementById(numLesson[i]);
    les.innerHTML = lessonsAndTime[_day_][0][i];
    les.style.cssText = "font-size: 55px; text-align: center;";

    var time = document.getElementById(timeLesson[i]);
    time.innerHTML = lessonsAndTime[_day_][1][i];
    time.style.cssText = "font-size: 55px; text-align: center;";
}

function button(a){
    var day = document.getElementById('Day');
    day.innerHTML = days[a];
    day.style.cssText = "margin: 30px; font-size: 70px; text-align: center;";

    for (let i = 0; i < 13; i++){
        var les = document.getElementById(numLesson[i]);
        les.innerHTML = lessonsAndTime[a][0][i];
        les.style.cssText = "font-size: 55px; text-align: center;";
    
        var time = document.getElementById(timeLesson[i]);
        time.innerHTML = lessonsAndTime[a][1][i];
        time.style.cssText = "font-size: 55px; text-align: center;";
}
}




